In [1]:
# Introducing Pandas data structures: Series, DataFrames and Index objects.

In [3]:
# Convention for importing pandas
import pandas as pd
days =pd.Series(['Monday','Tuesday','Wednesday'],index=[11,22,33])
print(days)

11       Monday
22      Tuesday
33    Wednesday
dtype: object

In [4]:
# Creating series with a numpy array.
import numpy as np
days_list = np.array(['Monday','Tuesday','Wednesday'])
numpy_days = pd.Series(days_list)
print(numpy_days)

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [5]:
# Using strings as index
days = pd.Series(['Monday','Tuesday','Wednesday'],index=['a','b','c'])
print(days)

a       Monday
b      Tuesday
c    Wednesday
dtype: object

In [6]:
# Creating series from a dictionary
days1 = pd.Series({'a':'Monday','b':'Tuesday','c':'Wednesday'})

In [7]:
print(days1)

a       Monday
b      Tuesday
c    Wednesday
dtype: object

In [8]:
days[0]

'Monday'

In [9]:
days[1:]

b      Tuesday
c    Wednesday
dtype: object

In [10]:
days['c']

'Wednesday'

In [11]:
# Working with dataframe.

In [12]:
#printing empty data frame
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [13]:
#Create a dataframe from a dictionary.
df_dict = {'Country':['Ghana','Kenya','Nigeria','Togo'],
           'Capital':['Accra','Nairbori','Abuja','Lome'],
           'Population':[1000,8500,3500,1200],
           'Age':[60,70,80,75]
          }
df1= pd.DataFrame(df_dict)

In [14]:
print(df1)

   Country   Capital  Population  Age
0    Ghana     Accra        1000   60
1    Kenya  Nairbori        8500   70
2  Nigeria     Abuja        3500   80
3     Togo      Lome        1200   75

In [15]:
df_list = [['Ghana','Accra',10000,60],
           ['kenya','Nairobi',8500,70],
           ['Nigeria','Abuja',35000,80],
           ['Nigeria','Abuja',35000,80] ]

In [16]:
df2 = pd.DataFrame(df_list, columns=['Country','Capital','Population','Age'],index=[2,4,6,8])

In [17]:
print(df2)

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8  Nigeria    Abuja       35000   80

In [18]:
df2.at[6,'Country']

'Nigeria'

In [19]:
df2.at[6,'Population']

35000

In [20]:
df2.iat[2,0]

'Nigeria'

In [21]:
df2.iloc[:,2:].mean()

Population    22125.0
Age              72.5
dtype: float64

In [22]:
df2.describe()

         Population        Age
count      4.000000   4.000000
mean   22125.000000  72.500000
std    14879.376107   9.574271
min     8500.000000  60.000000
25%     9625.000000  67.500000
50%    22500.000000  75.000000
75%    35000.000000  80.000000
max    35000.000000  80.000000

In [23]:
df_dict2 = [['James','Researcher',12,np.nan],
            ['Yemen','Artist',np.nan,175],
            ['Caro','Doctor',10,180],
            [np.nan,'Writer',8,150]
           ]

In [24]:
df3 = pd.DataFrame(df_dict2, columns=['Name','Profession','Experience','Height'])

In [25]:
df3

    Name  Profession  Experience  Height
0  James  Researcher        12.0     NaN
1  Yemen      Artist         NaN   175.0
2   Caro      Doctor        10.0   180.0
3    NaN      Writer         8.0   150.0

In [26]:
df3.replace(np.nan,11)

    Name  Profession  Experience  Height
0  James  Researcher        12.0    11.0
1  Yemen      Artist        11.0   175.0
2   Caro      Doctor        10.0   180.0
3     11      Writer         8.0   150.0

In [27]:
df3.dropna()

   Name Profession  Experience  Height
2  Caro     Doctor        10.0   180.0

In [28]:
df3.describe()

       Experience      Height
count         3.0    3.000000
mean         10.0  168.333333
std           2.0   16.072751
min           8.0  150.000000
25%           9.0  162.500000
50%          10.0  175.000000
75%          11.0  177.500000
max          12.0  180.000000